In [1]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\user\anaconda3\lib\site-packages (5.0.1)
Note: you may need to restart the kernel to use updated packages.

In [47]:
import pyodbc 

conn = pyodbc.connect (
    "Driver={ODBC Driver 17 for SQL Server};"
    "Server=RAM;"
    "Database=Sri_DB;"
    "Trusted_Connection=yes;"
)

cur = conn.cursor()

SELECT_QUERY = "select * from AGENTS"
cur.execute(SELECT_QUERY)

for i in cur:
    print(i)

('A001  ', 'Subbarao                                ', 'Bangalore                          ', Decimal('0.14'), '077-12346674   ', '')
('A002  ', 'Mukesh                                  ', 'Mumbai                             ', Decimal('0.11'), '029-12358964   ', '')
('A003  ', 'Alex                                    ', 'London                             ', Decimal('0.13'), '075-12458969   ', '')
('A004  ', 'Ivan                                    ', 'Torento                            ', Decimal('0.15'), '008-22544166   ', '')
('A005  ', 'Anderson                                ', 'Brisban                            ', Decimal('0.13'), '045-21447739   ', '')
('A006  ', 'McDen                                   ', 'London                             ', Decimal('0.15'), '078-22255588   ', '')
('A007  ', 'Ramasundar                              ', 'Bangalore                          ', Decimal('0.15'), '077-25814763   ', '')
('A008  ', 'Alford                                  ', 'New York                           ', Decimal('0.12'), '044-25874365   ', '')
('A009  ', 'Benjamin                                ', 'Hampshair                          ', Decimal('0.11'), '008-22536178   ', '')
('A010  ', 'Santakumar                              ', 'Chennai                            ', Decimal('0.14'), '007-22388644   ', '')
('A011  ', 'Ravi Kumar                              ', 'Bangalore                          ', Decimal('0.15'), '077-45625874   ', '')
('A012  ', 'Lucida                                  ', 'San Jose                           ', Decimal('0.12'), '044-52981425   ', '')

In [23]:
CREATE_QUERY = "CREATE TABLE Employee (EmpID int PRIMARY KEY, Name varchar(20), Age int, DeptID int)"

cur.execute(CREATE_QUERY)
cur.commit()

In [39]:
INSERT_QUERY = "INSERT INTO Employee values (13, 'Sri', 25, 4)"
cur.execute(INSERT_QUERY)
cur.commit()

EmpID = 16
Name = 'Sanjana'
Age = 25
DeptID = 2
INSERT_QUERY2 = "INSERT INTO Employee values (? ,?, ?, ?)"
cur.execute(INSERT_QUERY2, EmpID, Name, Age, DeptID)
cur.commit()

ROW1 = [22, 'Aishwarya', 27, 1]
ROW2 = [6, 'Rufina', 25, 11]
ROWLIST = []
ROWLIST.append(ROW1)
ROWLIST.append(ROW2)
cur.executemany(INSERT_QUERY2, ROWLIST)
cur.commit()

In [40]:
ID = 16 
UPDATE_QUERY = "UPDATE Employee SET Name = 'Sanjana Sudhakar' where EmpID = ?"
cur.execute(UPDATE_QUERY, ID)
cur.commit()

In [44]:
DELETE_QUERY = "DELETE FROM Employee where EmpID = ?"
cur.execute(DELETE_QUERY, ID)
cur.commit()

In [52]:
import pandas as pd 

df = pd.read_csv('Emp_Details.csv')
#df = pd.read_csv(r'C:\Users\User\Desktop\SRI_DB\Emp_Details.csv')
print(df)

   21   'Surya'  26  7
0  27   'Rekha'  25  7
1  12  'Sriram'  24  8

In [63]:
import pandas as pd 

df = pd.read_csv('Emp_Details.csv', header=None)
print(df)

    0       1   2  3
0  21   Surya  26  7
1  27   Rekha  25  7
2  12  Sriram  24  8

In [67]:
for each in df.itertuples():
    print(each)

Pandas(Index=0, _1=21, _2='Surya', _3=26, _4=7)
Pandas(Index=1, _1=27, _2='Rekha', _3=25, _4=7)
Pandas(Index=2, _1=12, _2='Sriram', _3=24, _4=8)

In [69]:
for each in df.itertuples():
    cur.execute("INSERT INTO Employee values (?,?,?,?)", each[1], each[2], each[3], each[4])
cur.commit()

In [70]:
cur.close()
conn.close()